import sys
input = sys.stdin.readline

#숫자가 0인거랑 자리수 채운 0 구분
key_A = [[1, 1, 1, 0, 1, 1, 1], [0, 0, 1, 0, 0, 1, 0], [1, 0, 1, 1, 1, 0, 1],
[1, 0, 1, 1, 0, 1, 1], [0, 1, 1, 1, 0, 1, 0], [1, 1, 0, 1, 0, 1, 1], [1, 1, 0, 1, 1, 1, 1],
[1, 1, 1, 0, 0, 1, 0], [1, 1, 1, 1, 1, 1, 1], [1, 1, 1, 1, 0, 1, 1]]
key_B = [[1, 1, 1, 0, 1, 1, 1], [0, 0, 1, 0, 0, 1, 0], [1, 0, 1, 1, 1, 0, 1],
[1, 0, 1, 1, 0, 1, 1], [0, 1, 1, 1, 0, 1, 0], [1, 1, 0, 1, 0, 1, 1], [1, 1, 0, 1, 1, 1, 1],
[1, 1, 1, 0, 0, 1, 0], [1, 1, 1, 1, 1, 1, 1], [1, 1, 1, 1, 0, 1, 1]]
zero = [1, 1, 1, 0, 1, 1, 1]

def counting(A, B):
    count = 0
    for i in range(7):
        if key_A[A][i] != key_B[B][i]:
            count += 1
    return count

tc = int(input())
for _ in range(tc):
    answer = 0
    key_A[0], key_B[0] = zero, zero
    A, B = map(int, input().split())
    #모자란 자리수 0으로 채우기
    for _ in range(5):
        if A == 0:
            key_A[0] = [0, 0, 0, 0, 0, 0, 0]
        if B == 0:
            key_B[0] = [0, 0, 0, 0, 0, 0, 0]
        answer += counting(A % 10, B % 10)
        A //= 10
        B //= 10
    print(answer)
